# c = 123.169
# x = 21.78

# if (x > c)
#     puts "more number x "
# else
#     puts "more number c "
# end

#==========================================
# first_number  = 40
# second_number = 66

# all_numbers = (first_number + second_number) / 2
# puts "середнє арифметичне"
# puts all_numbers
#==========================================

# x = 7
# if x % 2 == 0
#     puts "число парне"
# else
#     puts "число не парне"
# end

#==========================================


# puts "На годиннику 12:30 ночі а зранку тобі на роботу що ти зробиш
# 1. Підеш на кухню їсти канапки!!!
# 2. Відкладеш телифон та будеш спати"

# choice = gets.chomp

# if choice == "1"
#   puts" Ти прокинувся о 8:30, та ти повинен за 20хв бути на роботі
#   1.Подзвонити боссу та сказати що захворів
#   2.Швиденько зібратись та побігти на роботу"
#   choice = gets.chomp

#   if choice == "1"
#     puts "Бос сказав принести довідку із лікарні((
#         1.Подзвонити лікару
#         2.сказати правду"
#         choice = gets.chomp

#         if choice == "1"
#             abort "Лікар знав твого боса та повідомив йому про брехню"
#         else
#             abort "Бос сказав так білше не робити і дав відпочити))"
#         end

#   else
#     abort "Ти прибув на роботу та дізнався що зміну перенесоно на пізнішу годину і все добре)))"
#   end

# else
#   abort "Ти прокинувся о 6 ранку з хорошим настроєм та повний сил)))"
# end


#==========================================
# puts "Enter you number!!!"
# number1 = gets.chomp.to_i
# number2 = gets.chomp.to_i
# number3 = gets.chomp.to_i
# average = (number1 + number2 + number3) / 3
# puts "Середнє арифметичне вашиш чисел: #{average} "
#==========================================
# puts "Яка ціна на 1 доллар в гривнях"
# dolar = gets.chomp.to_f
# puts "Скільки вам потрібно обміняти гривень"
# hrivna = gets.chomp.to_f
# sum = hrivna / dolar
# puts "Ваші запаси в долларах #{sum} "


#==========================================
# загадати  любе число 0-15
# 3 спроби щоб вгадати число
# напист тепло холодно

# puts "Загадоно число від 0 до 15, відгадаї яке"

# rando = rand(15)
# answer = gets.chomp.to_i

# if rando =! answer

# else
#   abort "Вітаю ти вгадав правильно #{rando}"
# end
#==========================================
#==========================================
#==========================================
#==========================================

